app/views/estudiantes/edit.html.erb

  <%= f.label :subjects %><br>
  <%= f.collection_check_boxes :subject_ids, Subject.all, :id, :nombre %>
---
SELECT "subjects".* FROM "subjects"