app/views/estudiantes/index.html.erb

SELECT "subjects".* FROM "subjects" INNER JOIN "estudiantes_subjects" ON "subjects"."id" = "estudiantes_subjects"."subject_id" WHERE "estudiantes_subjects"."estudiante_id" = ?  [["estudiante_id", 1]]
---
			<strong>Asignaturas: </strong>
				<% estudiante.subjects.each do |asignatura| %>