app/views/estudiantes/new.html.erb

SELECT "subjects".* FROM "subjects"
---
<p>
  <% Subject.all.each do |asignatura|%>