app/controllers/estudiantes_controller.rb

	def index
		@estudiante = Estudiante.all
---
SELECT "estudiantes".* FROM "estudiantes"

	def edit
		@estudiante = Estudiante.find(params[:id])
---
SELECT  "estudiantes".* FROM "estudiantes" WHERE "estudiantes"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@estudiante = Estudiante.new(estudiante_params)
		@estudiante.save
---
INSERT INTO "estudiantes" ("nombre", "apellido", "identificacion", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def destroy
		@estudiante = Estudiante.find(params[:id])
		@estudiante.destroy
---
SELECT  "estudiantes".* FROM "estudiantes" WHERE "estudiantes"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "estudiantes" WHERE "estudiantes"."id" = ?  [["id", 8]]

	def update
		@estudiante = Estudiante.find(params[:id])
---
SELECT  "estudiantes".* FROM "estudiantes" WHERE "estudiantes"."id" = ? LIMIT 1  [["id", 1]]