app/controllers/respuestas_controller.rb

SELECT "respuesta".* FROM "respuesta"
---
	def index

		@respuesta = Respuesta.all