app/controllers/subjects_controller.rb

def index
		@subject = Subject.all
---
SELECT "subjects".* FROM "subjects"

	def create
		@subject = Subject.new(subject_params)
		@subject.save
---
INSERT INTO "subjects" ("nombre", "codigo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombre", "zadgd"], ["codigo", 0], ["created_at", "2016-03-02 21:37:44.435913"], ["updated_at", "2016-03-02 21:37:44.435913"]]

	def destroy
		@subject = Subject.find(params[:id])
		@subject.destroy
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 2]]

	def update
		@subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]