app/controllers/tareas_controller.rb

SELECT "tareas".* FROM "tareas"
---
	def index
		@tarea = Tarea.all

INSERT INTO "tareas" ("enunciado", "fecha", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
	def create
		@tarea = Tarea.new(tarea_params)
		@tarea.save