app/controllers/teachers_controller.rb

	def index
		@teacher = Teacher.all
---
SELECT "teachers".* FROM "teachers"

	def create
		@teacher = Teacher.new(teacher_params)
		@teacher.save
---
INSERT INTO "teachers" ("nombre", "apellido", "identificacion", "asignatura", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def destroy
		@teacher = Teacher.find(params[:id])
		@teacher.destroy
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "teachers" WHERE "teachers"."id" = ?  [["id", 3]]

	def update
		@teacher = Teacher.find(params[:id])
		@teacher.update(teacher_params)
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "teachers" SET "identificacion" = ?, "updated_at" = ? WHERE "teachers"."id" = ?  [["identificacion", 12456987], ["updated_at", "2016-03-02 22:14:31.499384"], ["id", 1]]